semestr1/his-fil/20.10.20-c.org
#+TITLE: 20 10 20 C
* okres presokratejski
- w opracowaniach opisywany jako nudny(?, opinia)
- filozofia przyrody
- dlaczego świat (przyroda) jest jaki jest?
- działają eleaci
- działają atomiści
- trwa do połowy 5 w p.n.e.
* okres klasyczny
- sofiści - wędrowni nauczyciele mądrości
- sokrates -> platon -> arystoteles
    |-> szkoły sokratyczne
- trwa od połowy 5 w p.n.e do połowy 4 w p.n.e. (323 p.n.e - śmierć Aleksandra Wielkiego)
* okres hellenistyczny
- powstaje stoicyzm
- powstaje epikureizm (nie mylić z hedonizem)
- sceptycyzm (reakcja na stoicyzm i epikureizm)
* okres rzymski
- od 1 w n.e. do 6 w n.e.
* podział filzofii wg Arystotelesa:
+ filozofia teoretyczna :: formułowanie wiedzy dla samej wiedzy
+ filozofia praktyczna :: formułowanie wiedzy dla osiąginęcia moralnej doskonałości
+ filozofia wytwórcza :: formułowanie wiedzy dla wytworzenia określonych przedmiotów
