semestr1/his-fil/20.10.20-c.md

# Table of Contents

1.  [okres presokratejski](#orgef1af49)
2.  [okres klasyczny](#orgd869e39)
3.  [okres hellenistyczny](#org348c866)
4.  [okres rzymski](#orgff750bd)
5.  [podział filzofii wg Arystotelesa:](#org76ff4a1)



<a id="orgef1af49"></a>

# okres presokratejski

-   w opracowaniach opisywany jako nudny(?, opinia)
-   filozofia przyrody
-   dlaczego świat (przyroda) jest jaki jest?
-   działają eleaci
-   działają atomiści
-   trwa do połowy 5 w p.n.e.


<a id="orgd869e39"></a>

# okres klasyczny

-   sofiści - wędrowni nauczyciele mądrości
-   sokrates -> platon -> arystoteles
    
    <table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
    
    
    </table>
-   trwa od połowy 5 w p.n.e do połowy 4 w p.n.e. (323 p.n.e - śmierć Aleksandra Wielkiego)


<a id="org348c866"></a>

# okres hellenistyczny

-   powstaje stoicyzm
-   powstaje epikureizm (nie mylić z hedonizem)
-   sceptycyzm (reakcja na stoicyzm i epikureizm)


<a id="orgff750bd"></a>

# okres rzymski

-   od 1 w n.e. do 6 w n.e.


<a id="org76ff4a1"></a>

# podział filzofii wg Arystotelesa:

-   **filozofia teoretyczna:** formułowanie wiedzy dla samej wiedzy
-   **filozofia praktyczna:** formułowanie wiedzy dla osiąginęcia moralnej doskonałości
-   **filozofia wytwórcza:** formułowanie wiedzy dla wytworzenia określonych przedmiotów

